'''
4、题目简述
在抗洪抢险中,解放军战士的冲锋舟加满油沿东西方向的河流抢救灾民,早晨从A地出发,晚上到达B地,
约定向东记为正，向西记为负，当天的航行路程记录如下(单位：千米) :

luchengrecords = [+14,-9,+8,-7,+13,-3,+6,-15]

python程序说明
1.请输入一个大于-10且小于10的航行路程
2.输出列表中所有大于该航行路程的航行路程

样例输入
请输入一个大于-10且小于10的航行路程:-5
样例输出
航行路程(千米):14
航行路程(千米):8
航行路程(千米):13
航行路程(千米):-3
航行路程(千米):6

'''

luchengrecords = [+14, -9, +8, -7, +13, -3, +6, -15]

lucheng = int(input('请输入一个大于-10且小于10的航行路程:'))
for m in luchengrecords:
    if m>lucheng:
        print('航行路程(千米):'+str(m))

'''
上面代码存在的问题:1、当输入的数字不在给定的范围之内时,代码直接退出了,并没有说明原因
对上面代码的改进:

luchengrecords = [+14, -9, +8, -7, +13, -3, +6, -15]

while True:
    try:
        user_input = int(input('请输入一个大于-10且小于10的航行路程:'))
        if -10 < user_input < 10:
            break
        else:
            print('输入错误：数字必须大于 -10 且小于 10,请重新输入！')
    except ValueError:
        print('输入错误：请输入一个有效的整数！')

for m in luchengrecords:
    if m > user_input:
        print('航行路程(千米):' + str(m))
'''